Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: The value will then be displayed on the right hand side beneath the Inspect button.
it_it: Il valore verrà quindi visualizzato sul lato destro sotto il pulsante Inspect.

source: The velocity mode is a tool that allows running a motor at a selectable velocity.
it_it: La modalità Velocity è uno strumento che consente di far funzionare un motore a una velocità selezionabile.

source: The version of lvgl used is 8.3, and you can query and use the LVGL API through the following documentation
it_it: La versione di lvgl utilizzata è la 8.3 ed è possibile interrogare e utilizzare l'API LVGL tramite la seguente documentazione

source: The version of lvgl used is 8.4, and you can query and use the LVGL API through the following documentation
it_it: La versione di lvgl utilizzata è la 8.4 ed è possibile interrogare e utilizzare l'API LVGL tramite la seguente documentazione:

source: The very best velocity values are those where the load value is zero (areas that do not show any green, yellow or red line).
it_it: I valori di velocità migliori sono quelli in cui il valore del carico è zero (aree che non mostrano alcuna linea verde, gialla o rossa).

source: The window is divided into an RPDO tab and a TPDO tab.
it_it: La finestra è divisa in una scheda RPDO e una scheda TPDO.

source: The working directory is the user’s temporary path plus TMCL-IDE.
it_it: La directory di lavoro è il path temporaneo dell'utente più TMCL-IDE.

source: Then click the Change button, and the new value will be copied to the variable defined by the Index and Bank value.
it_it: Cliccare poi sul pulsante Change e il nuovo valore verrà copiato nella variabile definita dai valori Index e Bank.

source: Then click the left arrow button or double click the object.
it_it: Quindi cliccare sul pulsante freccia sinistra o doppio clic sull'oggetto.

source: Then configure the I2C bus, including the clock source, ports, pins, and enable internal pull-up resistors, and initialize the I2C master bus.
it_it: Quindi, si configura il bus I2C, inclusi la sorgente di clock, le porte, i pin e si abilitano le resistenze di pull-up interne, e si inizializza il bus master I2C.

source: Then create a file, write data into it, rename the file, and read the content of the renamed file.
it_it: Poi crea un file, ci scrive i dati, lo rinomina e ne legge il contenuto.

source: Then create a ESP_IOExpander_CH422G instance, initialize it, and start its operation.
it_it: Poi crea un'istanza di ESP_IOExpander_CH422G, la inizializza e ne avvia il funzionamento.

source: Then create a ESP_IOExpander_CH422G object to manage the extended IO pins, initialize and set multiple pins as output modes, and control the status of pins such as touchscreen reset (TP_RST), LCD backlight (LCD_BL), LCD reset (LCD_RST), TF card select (SD_CS), and USB select (USB_SEL).
it_it: Quindi, crea un oggetto ESP_IOExpander_CH422G per gestire i pin IO estesi, inizializzare e impostare più pin come modalità di output e controllare lo stato di pin come reset del touchscreen (TP_RST), retroilluminazione LCD (LCD_BL), reset LCD (LCD_RST), selezione della scheda TF (SD_CS) e selezione USB (USB_SEL).

source: Then create and initialize the panel device, configure the RGB bus as needed.
it_it: Quindi, crea e inizializza il dispositivo del pannello, configura il bus RGB secondo necessità.

source: Then install the UART driver, set the UART pins, and allocate a temporary buffer for receiving data.
it_it: Quindi, è stato installato il driver UART, sono stati impostati i pin UART e è stato allocato un buffer temporaneo per la ricezione dei dati.

source: Then print a message indicating that you want to display the demonstration content of LVGL.
it_it: Quindi, visualizza un messaggio che indica che si vuole visualizzare il contenuto dimostrativo di LVGL.

source: Then start the motor by setting in the target velocity in the Target field.
it_it: Poi, avviare il motore impostando la velocità target nel campo Target.

source: Then the value modification dialog will be shown:
it_it: Verrà visualizzata la finestra di dialogo per la modifica del valore:

source: Then you can go through it step-by-step.
it_it: Poi è possibile seguirla passo dopo passo.

source: Then, according to the different alarms triggered, perform corresponding processing.
it_it: Poi, in base ai diversi allarmi attivati, esegue l'elaborazione corrispondente.

source: Then, all debugger functions will be disabled and all other functions of the TMCL-IDE will be enabled again.
it_it: A questo punto, tutte le funzioni del debugger saranno disabilitate e tutte le altre funzioni di TMCL-IDE saranno nuovamente abilitate.

source: Then, also set up the current down step and current up step parameters as well as the current minimum parameter.
it_it: Quindi, si impostano anche i parametri di riduzione e aumento della corrente, nonché il parametro di corrente minima.

source: Then, click the Inspect button to display its contents.
it_it: Poi cliccare sul pulsante Inspect per visualizzarne il contenuto.

source: Then, click the Export to DCF button and select where to save the DCF file.
it_it: Poi, cliccare sul pulsante Export to DCF e selezionare dove salvare il file DCF.

source: Then, commands can use module index 1 and module index 3, like this:
it_it: Quindi, i comandi possono utilizzare l'indice del modulo 1 e l'indice del modulo 3, in questo modo:

source: Then, it will create a file, write to the file, rename the file, and read the renamed file:
it_it: Quindi, creerà un file, scriverà al suo interno, lo rinominerà e leggerà il file rinominato:

source: Then, iterate through possible I2C device addresses from location 0x01 to 0x7f using a loop.
it_it: Quindi, si itera attraverso i possibili indirizzi dei dispositivi I2C dalla posizione 0x01 alla 0x7f utilizzando un loop.

source: Then, print "Create LCD device", create an LCD object ESP_PanelLcd, pass in parameters such as panel bus object, number of color bits, and reset pins to initialize, reset, and start the operation.
it_it: Poi, stampa "Create LCD device", crea un oggetto LCD ESP_PanelLcd, passa parametri come l'oggetto bus del pannello, il numero di bit di colore e i pin di reset per inizializzare, resettare e avviare l'operazione.

source: Then, through a loop, ensure the serial port initialization is successful.
it_it: Quindi, tramite un ciclo, assicurarsi che l'inizializzazione della porta seriale abbia esito positivo.

source: There are 256 banks of local variables, and each bank provides 256 local variables.
it_it: Sono disponibili 256 banchi di variabili locali e ogni banco fornisce 256 variabili locali.

source: There are also some special commands for using Trinamic evaluation boards (combinations of Startrampe or Landungsbruecke with other chip evaluation boards).
it_it: Sono disponibili anche alcuni comandi speciali per l'utilizzo delle evaluation board Trinamic (combinazioni di Startrampe o Landungsbruecke con altre schede di valutazione di chip).

source: There are two DLL files in the sample files (corresponding to 64-bit and 32-bit systems respectively).
it_it: I file di esempio contengono due file DLL (corrispondenti rispettivamente ai sistemi a 64 bit e a 32 bit).

source: There are two different versions of the Parameter Calculator: one for step-per motor modules that are based on the TMC429 motion controller (older modules like the TMCM-140, TMCM-343, TMCM-351, TMCM-1110, TMCM-1140, TMCM-1141, TMCM-1160, TMCM-1161, TMCM-1180, TMCM-1181, TMCM-3110 and TMCM-6110) where internal units are used for velocity and acceleration parameters and one for all other stepper motor modules where velocity and acceleration values are given as pps (pulses per second) units.
it_it: Esistono due diverse versioni del "Parameter Calculator": una per i moduli motore passo-passo basati sul controller di movimento TMC429 (moduli più vecchi come TMCM-140, TMCM-343, TMCM-351, TMCM-1110, TMCM-1140, TMCM-1141, TMCM-1160, TMCM-1161, TMCM-1180, TMCM-1181, TMCM-3110 e TMCM-6110), in cui vengono utilizzate unità interne per i parametri di velocità e accelerazione, e una per tutti gli altri moduli motore passo-passo, in cui i valori di velocità e accelerazione sono espressi in unità pps (impulsi al secondo).

source: There is also a Linux version of the TMCL-IDE with automated installation.
it_it: Esiste anche una versione Linux di TMCL-IDE con installazione automatica.

source: There is also a tool that can generate the module definitions: Just choose Options/Module definitions in the TMCL/PC menu to display the Module Assignment Dialog.
it_it: Esiste anche uno strumento in grado di generare le definizioni dei moduli: Basta selezionare Options/Module definitions nel menu TMCL/PC per visualizzare la Finestra di dialogo Assegnazione moduli.

source: There is always also a group that contains all registers.
it_it: È sempre presente anche un gruppo che contiene tutti i registri.

source: There is an option called Start from zero PI in all three modes.
it_it: È presente un'opzione denominata Start from zero PI in tutte e tre le modalità.

source: Therefore, the newly added device may not be visible as a new port in the Device Manager.
it_it: Pertanto, il dispositivo appena aggiunto potrebbe non essere visibile come nuova porta in "Device Manager" [Gestione Dispositivi].

source: These are USB, RS232, RS485 and CAN.
it_it: Queste sono USB, RS232, RS485 e CAN.

source: These are all modules and evaluation boards that are currently connected.
it_it: Si tratta di tutti i moduli e le evaluation board attualmente connesse.

source: These are for example tools like Direct Mode, Position Graph, Velocity Graph, Position Mode, Velocity Mode and also some more tools described in chapter 4.
it_it: Si tratta ad esempio di tool come Direct Mode, Position Graph, Velocity Graph, Position Mode, Velocity Mode ed anche altri strumenti descritti nel capitolo 4.

source: These are for example flags that represent the states of the end switches or the state of the ramp generator or error flags of a motor driver.
it_it: Si tratta, ad esempio, di flag che rappresentano gli stati degli switche di fine corsa o lo stato del generatore di rampa o di flag di errore di un driver motore.

source: These are mainly the following parameters:
it_it: Si tratta principalmente dei seguenti parametri:

source: These are mainly the maximum current, start current, number of poles and (if supported) if the hall signals have to be inverted or hall interpolation is to be used.
it_it: Si tratta principalmente della corrente massima, della corrente di spunto, del numero di poli e (se supportato) se i segnali Hall devono essere invertiti o se si deve utilizzare l'interpolazione Hall.

source: These are most newer TRINAMIC stepper motor control modules.
it_it: Si tratta della maggior parte dei moduli di controllo motore passo-passo TRINAMIC più recenti.

source: These are older modules like the TMCM-140, the TMCM-343 or the TMCM-351.
it_it: Si tratta di moduli più vecchi come il TMCM-140, il TMCM-343 o il TMCM-351.

source: These are parameters like RS232 baud rate or CAN bit rate.
it_it: Si tratta di parametri come la velocità di trasmissione RS232 o la velocità di trasmissione CAN.

source: These are the EDS file name as contained by the EDS file, the product description and the product name.
it_it: Queste sono il nome del file EDS contenuto nel file EDS, la descrizione del prodotto e il nome del prodotto.

source: These are the encoder steps per rotation (encoder resolution), encoder direction and the encoder initialization mode.
it_it: Questi sono i passi dell'encoder per giro (risoluzione dell'encoder), la direzione dell'encoder e la modalità di inizializzazione dell'encoder.

source: These are the following commands:
it_it: Si tratta dei seguenti comandi:

source: These are the following functions:
it_it: Queste sono le seguenti funzioni:

source: These are tools that can work with all supported modules.
it_it: Si tratta di strumenti che possono funzionare con tutti i moduli supportati.

source: These kind of tools are called wizards.
it_it: Questi strumenti sono chiamati procedure guidate.

source: These modules can then also be used with the CANopen protocol instead of the TMCL protocol.
it_it: Questi moduli possono quindi essere utilizzati anche con il protocollo CANopen anziché con il protocollo TMCL.

source: These pins are normally directly connected to output pins of the Landungsbruecke or Startrampe board, so that their states can be set.
it_it: Questi pin sono normalmente collegati direttamente ai pin di uscita della scheda Landungsbrücke o Startrampe, in modo da poterne impostare lo stato.

source: These programs can be downloaded to a module and then run stand-alone on that module.
it_it: Questi programmi possono essere scaricati su un modulo e poi eseguiti autonomamente su quel modulo.

source: These tools are described in the sections of this chapter.
it_it: Questi strumenti sono descritti nelle sezioni di questo capitolo.

source: These will be copied to the currently active editor page of the TMCL/PC host.
it_it: Questi verranno copiati nella pagina dell'editor attualmente attiva dell'host TMCL/PC.

source: These will be saved into the DCF file without further processing.
it_it: Questi verranno salvati nel file DCF senza ulteriori elaborazioni.

source: These, the icon bar and device tree are freely moveable and can be arranged to an own layout.
it_it: Questi, la barra delle icone e l'albero dei dispositivi sono liberamente spostabili e possono essere organizzati in un layout personalizzato.

source: This PC Software is a non-commercial publication that seeks to provide concise scientific and technical user information to the target user.
it_it: Questo software per PC è una pubblicazione non commerciale che si propone di fornire informazioni scientifiche e tecniche concise all'utente finale.

source: This allows permanent monitoring of TMCL axis parameters and user variables (which is also possible while a TMCL program is running on the module).
it_it: Ciò consente il monitoraggio permanente dei parametri degli assi TMCL e delle variabili utente (possibile anche durante l'esecuzione di un programma TMCL sul modulo).

source: This allows permanent monitoring of TMCL user variables (which is also possible while a TMCL program is running on the module).
it_it: Ciò consente il monitoraggio permanente delle variabili utente TMCL (possibile anche durante l'esecuzione di un programma TMCL sul modulo).

source: This allows permanent monitoring of axis parameters (which is also possible while a TMCL program is running on the module).
it_it: Ciò consente il monitoraggio permanente dei parametri degli assi (possibile anche durante l'esecuzione di un programma TMCL sul modulo).

source: This can also be changed later in the Download methods section (click on it to pop up the options)
it_it: Questa impostazione può essere modificata in seguito nella sezione dei Metodi di Download (cliccare per visualizzare le opzioni).

source: This can be R (read only), W (write only) or RW (read/write).
it_it: Può essere R (sola lettura), W (sola scrittura) o RW (lettura/scrittura).

source: This can be controlled using the Torque Mode tool.
it_it: Questa funzione può essere controllata utilizzando il tool "Torque Mode".

source: This can be necessary either if there is no EDS file for the connected device or if objects are to be accessed that are not contained in the EDS file (for example when developing a new device).
it_it: Ciò può essere necessario se non è presente un file EDS per il dispositivo connesso o se si desidera accedere a oggetti non contenuti nel file EDS (ad esempio durante lo sviluppo di un nuovo dispositivo).

source: This can be selected using the buttons at the bottom of the window.
it_it: È possibile selezionare questa opzione utilizzando i pulsanti nella parte inferiore della finestra.

source: This can be useful for starting the program from other addresses than 0.
it_it: Questo può essere utile per avviare il programma da indirizzi diversi da 0.

source: This can be useful when event triggered PDOs are to be displayed.
it_it: Questo può essere utile quando si devono visualizzare PDO attivati ​​da eventi.

source: This can either be the actual position, the last target position or (on some closed loop modules) the encoder position.
it_it: Può essere la posizione effettiva, l'ultima posizione target o (su alcuni moduli a circuito chiuso) la posizione dell'encoder.

source: This can help for example when tuning ramp parameters or also when debugging a TMCL program that is running on the module.
it_it: Questo può essere utile, ad esempio, durante la regolazione dei parametri di rampa o anche durante il debug di un programma TMCL in esecuzione sul modulo.

source: This chapter introduces setting up the Arduino environment, including the Arduino IDE, management of ESP32 boards, installation of related libraries, program compilation and downloading, as well as testing demos.
it_it: Questo capitolo introduce la configurazione dell'ambiente Arduino, incluso l'IDE Arduino, la gestione delle schede ESP32, l'installazione delle librerie correlate, la compilazione e il download dei programmi, nonché il test delle demo.

source: This chapter introduces setting up the ESP-IDF environment setup, including the installation of Visual Studio and the Espressif IDF plugin, program compilation, downloading, and testing of demos, to assist users in mastering the development board and facilitating secondary development.
it_it: Questo capitolo introduce la configurazione dell'ambiente ESP-IDF, inclusa l'installazione di Visual Studio e del plugin Espressif IDF, la compilazione del programma, il download e il test delle demo, per aiutare gli utenti a padroneggiare la scheda di sviluppo e facilitare lo sviluppo secondario.

source: This context menu offers the following functions:
it_it: Questo menù contestuale offre le seguenti funzioni:

source: This file can then be used for example with the TMCL Creator.
it_it: Questo file può quindi essere utilizzato, ad esempio, con TMCL Creator.

source: This function allows checking the program which is currently stored in the TMCL program memory of a module.
it_it: Questa funzione consente di controllare il programma attualmente memorizzato nella memoria TMCL di un modulo.

source: This function automatically executes the TMCL program step-by-step, so that the flow of the program can be seen.
it_it: Questa funzione esegue automaticamente il programma TMCL passo dopo passo, in modo che sia possibile visualizzarne il flusso.

source: This function can also be used when the program execution is paused (by a breakpoint or by the Pause function) to reset it and to ensure that the program can be started again from the beginning.
it_it: Questa funzione può essere utilizzata anche quando l'esecuzione del programma è in pausa (da un breakpoint o dalla funzione Pause) per reimpostarla e garantire che il programma possa essere riavviato dall'inizio.

source: This function determines the message format and prints the message identifier and data content (excluding remote transmission requests), effectively handling received messages on the TWAI bus and responding to alerts.
it_it: Questa funzione determina il formato del messaggio e ne stampa l'identificativo e il contenuto dei dati (escluse le richieste di trasmissione remota), gestendo efficacemente i messaggi ricevuti sul bus TWAI e rispondendo agli avvisi.

source: This function is also used to continue the program after a breakpoint or after single stepping.
it_it: Questa funzione viene utilizzata anche per continuare il programma dopo un breakpoint o dopo un'esecuzione passo-passo.

source: This function is mainly used to initialize the TF card.
it_it: Questa funzione viene utilizzata principalmente per inizializzare la scheda TF.

source: This function is used to test the functionality of the TF card.
it_it: Questa funzione viene utilizzata per testare la funzionalità della scheda TF.

source: This generates an MVP ABS command.
it_it: Questo genera un comando MVP ABS.

source: This generates an MVP REL command.
it_it: Questo genera un comando MVP REL.

source: This information will be written to the DCF file, without being further processed by the TMCL-IDE.
it_it: Queste informazioni verranno scritte nel file DCF, senza essere ulteriormente elaborate da TMCL-IDE.

source: This is a low-cost, high-performance MCU development board designed by Waveshare.
it_it: Questa è una scheda di sviluppo MCU a basso costo e ad alte prestazioni progettata da Waveshare.

source: This is achieved by writing the save signature to object 1010h sub-index 1 after the download of all objects contained by the DCF file has completed.
it_it: Ciò si ottiene scrivendo la firma di salvataggio nell'oggetto 1010h sottoindice 1 al termine del download di tutti gli oggetti contenuti nel file DCF.

source: This is an indicator for the vibration of the motor at the given velocity.
it_it: Questo è un indicatore della vibrazione del motore alla velocità indicata.

source: This is being done by continuously reading objects via SDO.
it_it: Ciò avviene tramite la lettura continua degli oggetti tramite SDO.

source: This is caused by the fact that none of Peak-Systems setups install the PCANBasic.dll, which is needed by the TMCL-IDE (this DLL contains the basic Peak CAN API used by the TMCL-IDE).
it_it: Questo è dovuto al fatto che nessuna delle configurazioni di Peak-Systems installa PCANBasic.dll, necessario per TMCL-IDE (questa DLL contiene l'API Peak CAN di base utilizzata da TMCL-IDE).

source: This is necessary if the names contain spaces.
it_it: Questo è necessario se i nomi contengono spazi.

source: This is needed for tools that regularly need to update values that they are displaying, like the Position Graph or the Velocity Graph for example.
it_it: Ciò è necessario per gli strumenti che devono aggiornare regolarmente i valori visualizzati, come ad esempio il Position Graph o il Velocity Graph.

source: This is needed to adapt StealthChop to different motors.
it_it: Ciò è necessario per adattare StealthChop a diversi motori.

source: This is not supported by the Firmware Update Tool.
it_it: Questo non è supportato dal Firmware Update Tool.

source: This is only possible when closed-loop mode is active.
it_it: Questo è possibile solo quando la modalità a circuito chiuso è attiva.

source: This is to specify on which of the connected modules the command shall be executed.
it_it: Questo serve a specificare su quale dei moduli connessi deve essere eseguito il comando.

source: This is useful for example when recording the StallGuard profile of a linear drive.
it_it: Questa funzione è utile, ad esempio, quando si registra il profilo StallGuard di un azionamento lineare.

source: This is useful when also other protocols are used on the same CAN bus.
it_it: Questo è utile quando vengono utilizzati anche altri protocolli sullo stesso bus CAN.

source: This list can then be saved in different ways:
it_it: Questo elenco può essere salvato in diversi modi:

source: This makes it possible to control and explore also Trinamic modules that are equipped with CANopen firmware, just using the same tools.
it_it: Ciò consente di controllare ed esplorare anche i moduli Trinamic dotati di firmware CANopen, utilizzando gli stessi strumenti.

source: This may be the case of switching modes after not carrying out the power-off operation:
it_it: Questo potrebbe essere il caso di cambio di modalità dopo aver eseguito l'operazione di spegnimento:
